{
    "name": "Joseph Murphy",
    "contact": {
      "phone": "612.723.5373",
      "location": "Hopkins, MN 55343",
      "email": "joe.michael.murphy@gmail.com",
      "linkedin": "Linkedin Profile"
    },
    "title": "Software Automation Test Engineer",
    "summary": "Quality Assurance professional with 14 years of experience of manual and automation testing. Directed testing in waterfall and Agile teams. I was the founding member of the current automation team. I helped promote the idea of automation to the IT department through my work in developing automated test suites and writing best practice guidelines. I encouraged the use of testing tools, and I trained team members on these tools.",
    "experience": [
      {
        "company": "Old Republic National insurance Co",
        "location": "Minneapolis, MN",
        "dates": "06/2016 - PRESENT",
        "position": "Automation Test Engineer",
        "responsibilities": [
          "Responsible for creating and maintaining automation test suites, through Selenium, Appium, ReadyAPI and SQL scripts.",
          "Built a custom C# testing tool that reduced testing time by 80% and helped contribute to a project completing 8 months early.",
          "Developed Selenium frameworks from scratch, the largest containing tests for 22 unique applications.",
          "Implemented a DevOps code deployment strategy that is in full use by the QA automation team.",
          "Integrated Cucumber into an established Selenium test suite that helped with the use of Gherkin and BDD project management.",
          "Organized and attended open defect meetings with developers and team leads that improved collaboration and lead to quicker solutions."
        ]
      },
      {
        "company": "Old Republic National insurance Co",
        "location": "Minneapolis, MN",
        "dates": "11/2012 – 06/2016",
        "position": "Quality Assurance Test Analyst",
        "responsibilities": [
          "Manual testing of websites or executables, web servers/services, and databases, along with working closely with the business community.",
          "Principal QA tester for over 4 years on a flagship application that had integrations with 20 other applications.",
          "Oversaw testing efforts for events, including Disaster Recovery, data migrations, and frequent involvement in scheduled or emergency production deployments.",
          "Acted as a SME on an application and answered questions from users located nationwide and had different use cases.",
          "Trained new team members on the large scope of corporate applications, required technologies, and departmental policies."
        ]
      },
      {
        "company": "Eagle Creek Software Services",
        "location": "Pierre, SD",
        "dates": "1/2010 – 11/2012",
        "position": "Quality Assurance Analyst",
        "responsibilities": [
          "Participated in work contracts that required testing of ETL workflows using Teradata and PuTTY.",
          "Authored test plans, test cases, test summaries, use case guides, and best practices documentation for team building.",
          "Documented test procedures to produce replicability and compliance with standards.",
          "Investigated customer problems referred by technical support.",
          "Collaborated with field staff and customers to evaluate and diagnose problems and recommended solutions."
        ]
      }
    ],
    "education": {
      "institution": "St. Cloud State University",
      "location": "St. Cloud, MN",
      "degree": "Bachelor of Arts – Business Information systems",
      "graduationDate": "Dec 2009"
    },
    "skills": [
      "C#", "MSSQL", "VB", "JS", "TS", "Selenium", "Appium", "Browserstack",
      "ReadyAPI", "Postman", "ADO/GIT CI workflow", "UIPath", "TestConnect",
      "Json", "html", "CSS", "Jenkins", "NUnit", "Web Design", "Restful Services",
      "VMWare", "Node.js"
    ],
    "volunteerExperience": [
      {
        "organization": "Mentor Program - Pierre, SD",
        "dates": "2011 - 2012",
        "description": "Helped incoming Eagle Creek employees, many right out of college, adjust to a new job and city."
      }
    ]
  }
  